Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/usci_a_uart.c
        assert(
                (USCI_A_UART_MODE == param->uartMode) ||
                (USCI_A_UART_IDLE_LINE_MULTI_PROCESSOR_MODE == param->uartMode) ||
                (USCI_A_UART_ADDRESS_BIT_MULTI_PROCESSOR_MODE == param->uartMode) ||
                (USCI_A_UART_AUTOMATIC_BAUDRATE_DETECTION_MODE == param->uartMode)
                );

        assert(
                (USCI_A_UART_CLOCKSOURCE_ACLK == param->selectClockSource) ||
                (USCI_A_UART_CLOCKSOURCE_SMCLK == param->selectClockSource)
                );

        assert(
                (USCI_A_UART_MSB_FIRST == param->msborLsbFirst) ||
                (USCI_A_UART_LSB_FIRST == param->msborLsbFirst)
                );

        assert(
                (USCI_A_UART_ONE_STOP_BIT == param->numberofStopBits) ||
                (USCI_A_UART_TWO_STOP_BITS == param->numberofStopBits)
                );

        assert(
                (USCI_A_UART_NO_PARITY == param->parity) ||
                (USCI_A_UART_ODD_PARITY == param->parity) ||
                (USCI_A_UART_EVEN_PARITY == param->parity)
                );

        bool retVal = STATUS_SUCCESS;

        //Disable the USCI Module
        HWREG8(baseAddress + OFS_UCAxCTL1) |= UCSWRST;

        //Clock source select
        HWREG8(baseAddress + OFS_UCAxCTL1) &= ~UCSSEL_3;
        HWREG8(baseAddress + OFS_UCAxCTL1) |= param->selectClockSource;

        //MSB, LSB select
        HWREG8(baseAddress + OFS_UCAxCTL0) &= ~UCMSB;
        HWREG8(baseAddress + OFS_UCAxCTL0) |= param->msborLsbFirst;

        //UCSPB = 0(1 stop bit) OR 1(2 stop bits)
        HWREG8(baseAddress + OFS_UCAxCTL0) &= ~UCSPB;
        HWREG8(baseAddress + OFS_UCAxCTL0) |= param->numberofStopBits;

        //Parity
        switch (param->parity) {
        case USCI_A_UART_NO_PARITY:
                //No Parity
                HWREG8(baseAddress + OFS_UCAxCTL0) &= ~UCPEN;
                break;
        case USCI_A_UART_ODD_PARITY:
                //Odd Parity
                HWREG8(baseAddress + OFS_UCAxCTL0) |= UCPEN;
                HWREG8(baseAddress + OFS_UCAxCTL0) &= ~UCPAR;
                break;
        case USCI_A_UART_EVEN_PARITY:
                //Even Parity
                HWREG8(baseAddress + OFS_UCAxCTL0) |= UCPEN;
                HWREG8(baseAddress + OFS_UCAxCTL0) |= UCPAR;
                break;
        }

        //Modulation Control Registers
        HWREG16(baseAddress + OFS_UCAxBRW ) = param->clockPrescalar;
        HWREG8(baseAddress + OFS_UCAxMCTL) = ((param->firstModReg << 4) +
                                              (param->secondModReg << 1) +
                                              param->overSampling );

        //Asynchronous mode & 8 bit character select & clear mode
        HWREG8(baseAddress + OFS_UCAxCTL0) &=  ~(UCSYNC +
                                                 UC7BIT +
                                                 UCMODE_3
                                                 );

        //Configure  UART mode.
        HWREG8(baseAddress + OFS_UCAxCTL0) |= param->uartMode;

        //Reset UCRXIE, UCBRKIE, UCDORM, UCTXADDR, UCTXBRK
        HWREG8(baseAddress + OFS_UCAxCTL1)  &= ~(UCRXEIE + UCBRKIE + UCDORM +
                                                 UCTXADDR + UCTXBRK
                                                 );

        return retVal;
} //*****************************************************************************
//
//! \brief Transmits a byte from the UART Module.
//!
//! This function will place the supplied data into UART transmit data register
//! to start transmission
//!
//! \param baseAddress is the base address of the USCI_A_UART module.
//! \param transmitData data to be transmitted from the UART module
//!
//! Modified bits of \b UCAxTXBUF register.
//!
//! \return None
//
//*****************************************************************************
void USCI_A_UART_transmitData( uint16_t baseAddress,
                               uint8_t transmitData
                               )
{
        //If interrupts are not used, poll for flags
        if (!(HWREG8(baseAddress + OFS_UCAxIE) & UCTXIE))
                //Poll for transmit interrupt flag
                while (!(HWREG8(baseAddress + OFS_UCAxIFG) & UCTXIFG)) ;

        HWREG8(baseAddress + OFS_UCAxTXBUF) = transmitData;
}

//*****************************************************************************
//
//! \brief Receives a byte that has been sent to the UART Module.
//!
//! This function reads a byte of data from the UART receive data Register.
//!
//! \param baseAddress is the base address of the USCI_A_UART module.
//!
//! Modified bits of \b UCAxRXBUF register.
//!
//! \return Returns the byte received from by the UART module, cast as an
//!         uint8_t.
//
//*****************************************************************************
uint8_t USCI_A_UART_receiveData(uint16_t baseAddress)
{
        //If interrupts are not used, poll for flags
        if (!(HWREG8(baseAddress + OFS_UCAxIE) & UCRXIE))
                //Poll for receive interrupt flag
                while (!(HWREG8(baseAddress + OFS_UCAxIFG) & UCRXIFG)) ;

        return HWREG8(baseAddress + OFS_UCAxRXBUF);
}

//*****************************************************************************
//
//! \brief Enables individual UART interrupt sources.
//!
//! Enables the indicated UART interrupt sources.  The interrupt flag is first
//! and then the corresponding interrupt is enabled. Only the sources that are
//! enabled can be reflected to the processor interrupt; disabled sources have
//! no effect on the processor. Does not clear interrupt flags.
//!
//! \param baseAddress is the base address of the USCI_A_UART module.
//! \param mask is the bit mask of the interrupt sources to be enabled.
//!        Mask value is the logical OR of any of the following:
//!        - \b USCI_A_UART_RECEIVE_INTERRUPT - Receive interrupt
//!        - \b USCI_A_UART_TRANSMIT_INTERRUPT - Transmit interrupt
//!        - \b USCI_A_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT - Receive
//!           erroneous-character interrupt enable
//!        - \b USCI_A_UART_BREAKCHAR_INTERRUPT - Receive break character
//!           interrupt enable
//!
//! Modified bits of \b UCAxCTL1 register and bits of \b UCAxIE register.
//!
//! \return None
//
//*****************************************************************************
void USCI_A_UART_enableInterrupt(uint16_t baseAddress,
                                 uint8_t mask
                                 )
{
        assert(!(mask & ~(USCI_A_UART_RECEIVE_INTERRUPT
                          | USCI_A_UART_TRANSMIT_INTERRUPT
                          | USCI_A_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT
                          | USCI_A_UART_BREAKCHAR_INTERRUPT)));

        uint8_t locMask;

        locMask = (mask & (USCI_A_UART_RECEIVE_INTERRUPT
                           | USCI_A_UART_TRANSMIT_INTERRUPT));
        HWREG8(baseAddress + OFS_UCAxIE) |= locMask;

        locMask = (mask & (USCI_A_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT
                           | USCI_A_UART_BREAKCHAR_INTERRUPT));
        HWREG8(baseAddress + OFS_UCAxCTL1) |= locMask;
}

//*****************************************************************************
//
//! \brief Disables individual UART interrupt sources.
//!
//! Disables the indicated UART interrupt sources. Only the sources that are
//! enabled can be reflected to the processor interrupt; disabled sources have
//! no effect on the processor.
//!
//! \param baseAddress is the base address of the USCI_A_UART module.
//! \param mask is the bit mask of the interrupt sources to be disabled.
//!        Mask value is the logical OR of any of the following:
//!        - \b USCI_A_UART_RECEIVE_INTERRUPT - Receive interrupt
//!        - \b USCI_A_UART_TRANSMIT_INTERRUPT - Transmit interrupt
//!        - \b USCI_A_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT - Receive
//!           erroneous-character interrupt enable
//!        - \b USCI_A_UART_BREAKCHAR_INTERRUPT - Receive break character
//!           interrupt enable
//!
//! Modified bits of \b UCAxCTL1 register and bits of \b UCAxIE register.
//!
//! \return None
//
//*****************************************************************************
void USCI_A_UART_disableInterrupt(uint16_t baseAddress,
                                  uint8_t mask
                                  )
{
        assert(!(mask & ~(USCI_A_UART_RECEIVE_INTERRUPT
                          | USCI_A_UART_TRANSMIT_INTERRUPT
                          | USCI_A_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT
                          | USCI_A_UART_BREAKCHAR_INTERRUPT)));

        uint8_t locMask;

        if (locMask = (mask & (USCI_A_UART_RECEIVE_INTERRUPT
                               | USCI_A_UART_TRANSMIT_INTERRUPT)))
                HWREG8(baseAddress + OFS_UCAxIE) &= ~locMask;

        if (locMask = (mask & (USCI_A_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT
                               | USCI_A_UART_BREAKCHAR_INTERRUPT)))
                HWREG8(baseAddress + OFS_UCAxCTL1) &= ~locMask;
}

//*****************************************************************************
//
//! \brief Gets the current UART interrupt status.
//!
//! This returns the interrupt status for the UART module based on which flag
//! is passed.
//!
//! \param baseAddress is the base address of the USCI_A_UART module.
//! \param mask is the masked interrupt flag status to be returned.
//!        Mask value is the logical OR of any of the following:
//!        - \b USCI_A_UART_RECEIVE_INTERRUPT_FLAG - Receive interrupt flag
//!        - \b USCI_A_UART_TRANSMIT_INTERRUPT_FLAG - Transmit interrupt flag
//!
//! Modified bits of \b UCAxIFG register.
//!
//! \return Logical OR of any of the following:
//!         - \b USCI_A_UART_RECEIVE_INTERRUPT_FLAG Receive interrupt flag
//!         - \b USCI_A_UART_TRANSMIT_INTERRUPT_FLAG Transmit interrupt flag
//!         \n indicating the status of the masked flags
//
//*****************************************************************************
uint8_t USCI_A_UART_getInterruptStatus(uint16_t baseAddress,
                                       uint8_t mask)
{
        assert(!(mask & ~(USCI_A_UART_RECEIVE_INTERRUPT_FLAG
                          | USCI_A_UART_TRANSMIT_INTERRUPT_FLAG)));

        return HWREG8(baseAddress + OFS_UCAxIFG) & mask;
}

//*****************************************************************************
//
//! \brief Clears UART interrupt sources.
//!
//! The UART interrupt source is cleared, so that it no longer asserts. The
//! highest interrupt flag is automatically cleared when an interrupt vector
//! generator is used.
//!
//! \param baseAddress is the base address of the USCI_A_UART module.
//! \param mask is a bit mask of the interrupt sources to be cleared.
//!        Mask value is the logical OR of any of the following:
//!        - \b USCI_A_UART_RECEIVE_INTERRUPT_FLAG - Receive interrupt flag
//!        - \b USCI_A_UART_TRANSMIT_INTERRUPT_FLAG - Transmit interrupt flag
//!
//! Modified bits of \b UCAxIFG register.
//!
//! \return None
//
//*****************************************************************************
void USCI_A_UART_clearInterruptFlag(uint16_t baseAddress, uint8_t mask)
{
        assert(!(mask & ~(USCI_A_UART_RECEIVE_INTERRUPT_FLAG
                          | USCI_A_UART_TRANSMIT_INTERRUPT_FLAG)));

        //Clear the UART interrupt source.
        HWREG8(baseAddress + OFS_UCAxIFG) &= ~(mask);
}

//*****************************************************************************
//
//! \brief Enables the UART block.
//!
//! This will enable operation of the UART block.
//!
//! \param baseAddress is the base address of the USCI_A_UART module.
//!
//! Modified bits are \b UCSWRST of \b UCAxCTL1 register.
//!
//! \return None
//
//*****************************************************************************
void USCI_A_UART_enable(uint16_t baseAddress)
{
        //Reset the UCSWRST bit to enable the USCI Module
        HWREG8(baseAddress + OFS_UCAxCTL1) &= ~(UCSWRST);
}

//*****************************************************************************
//
//! \brief Disables the UART block.
//!
//! This will disable operation of the UART block.
//!
//! \param baseAddress is the base address of the USCI_A_UART module.
//!
//! Modified bits are \b UCSWRST of \b UCAxCTL1 register.
//!
//! \return None
//
//*****************************************************************************
void USCI_A_UART_disable(uint16_t baseAddress)
{
        //Set the UCSWRST bit to disable the USCI Module
        HWREG8(baseAddress + OFS_UCAxCTL1) |= UCSWRST;
}

//*****************************************************************************
//
//! \brief Gets the current UART status flags.
//!
//! This returns the status for the UART module based on which flag is passed.
//!
//! \param baseAddress is the base address of the USCI_A_UART module.
//! \param mask is the masked interrupt flag status to be returned.
//!        Mask value is the logical OR of any of the following:
//!        - \b USCI_A_UART_LISTEN_ENABLE
//!        - \b USCI_A_UART_FRAMING_ERROR
//!        - \b USCI_A_UART_OVERRUN_ERROR
//!        - \b USCI_A_UART_PARITY_ERROR
//!        - \b USCI_A_UART_BREAK_DETECT
//!        - \b USCI_A_UART_RECEIVE_ERROR
//!        - \b USCI_A_UART_ADDRESS_RECEIVED
//!        - \b USCI_A_UART_IDLELINE
//!        - \b USCI_A_UART_BUSY
//!
//! Modified bits of \b UCAxSTAT register.
//!
//! \return Logical OR of any of the following:
//!         - \b USCI_A_UART_LISTEN_ENABLE
//!         - \b USCI_A_UART_FRAMING_ERROR
//!         - \b USCI_A_UART_OVERRUN_ERROR
//!         - \b USCI_A_UART_PARITY_ERROR
//!         - \b USCI_A_UART_BREAK_DETECT
//!         - \b USCI_A_UART_RECEIVE_ERROR
//!         - \b USCI_A_UART_ADDRESS_RECEIVED
//!         - \b USCI_A_UART_IDLELINE
//!         - \b USCI_A_UART_BUSY
//!         \n indicating the status of the masked interrupt flags
//
//*****************************************************************************
uint8_t USCI_A_UART_queryStatusFlags(uint16_t baseAddress,
                                     uint8_t mask)
{
        assert(0x00 != mask && (USCI_A_UART_LISTEN_ENABLE +
                                USCI_A_UART_FRAMING_ERROR +
                                USCI_A_UART_OVERRUN_ERROR +
                                USCI_A_UART_PARITY_ERROR +
                                USCI_A_UART_BREAK_DETECT +
                                USCI_A_UART_RECEIVE_ERROR +
                                USCI_A_UART_ADDRESS_RECEIVED +
                                USCI_A_UART_IDLELINE +
                                USCI_A_UART_BUSY
                                ));

